In [1]:
import pandas as pd

In [4]:
data = "data/ex04-quiz.csv"
df = pd.read_csv(data, sep=",",skiprows=2, header=None)
df.head()

          0        1
0  Hokkaido  5183000
1    Aomori  1221000
2     Iwate  1196000
3    Miyagi  2290000
4     Akita   945000

In [6]:
df.columns = ["prefecture","population"]
df.head()

  prefecture  population
0   Hokkaido     5183000
1     Aomori     1221000
2      Iwate     1196000
3     Miyagi     2290000
4      Akita      945000